<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>PayloadDisplayName</key>
    <string>AdGuard</string>
    <key>PayloadDescription</key>
    <string>Adds the AdGuard DNS to Big Sur and iOS 14 based systems.</string>
    <key>PayloadIdentifier</key>
    <string>com.apple.profile.bac7cbc4-5202-47dc-98ce-aa6aec34d538</string>
    <key>PayloadScope</key>
    <string>System</string>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>bac7cbc4-5202-47dc-98ce-aa6aec34d538</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    <key>PayloadContent</key>
    <array>
      <!-- AdGuard DNS Default (DoH) -->
      <dict>
        <key>PayloadDisplayName</key>
        <string>AdGuard DNS over HTTPS</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dns.7464039c-dd0d-4528-80ae-9a0e38495aa9</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>7464039c-dd0d-4528-80ae-9a0e38495aa9</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>HTTPS</string>
          <key>ServerAddresses</key>
          <array>
            <string>2a10:50c0::ad1:ff</string>
            <string>2a10:50c0::ad2:ff</string>
            <string>94.140.14.14</string>
            <string>94.140.15.15</string>
          </array>
          <key>ServerURL</key>
          <string>https://dns.adguard-dns.com/dns-query</string>
        </dict>
      </dict>
      <!-- AdGuard DNS Default (DoT) -->
      <dict>
        <key>PayloadDisplayName</key>
        <string>AdGuard DNS over TLS</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dns.67cce299-b152-424e-a233-ebe73d3a4183</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>67cce299-b152-424e-a233-ebe73d3a4183</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>TLS</string>
          <key>ServerAddresses</key>
          <array>
            <string>2a10:50c0::ad1:ff</string>
            <string>2a10:50c0::ad2:ff</string>
            <string>94.140.14.14</string>
            <string>94.140.15.15</string>
          </array>
          <key>ServerName</key>
          <string>dns.adguard-dns.com</string>
        </dict>
      </dict>
      <!-- AdGuard DNS Family Protection (DoH) -->
      <dict>
        <key>PayloadDisplayName</key>
        <string>AdGuard Family DNS over HTTPS</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dns.796dccab-fc3f-4227-9201-732c58d9a82a</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>796dccab-fc3f-4227-9201-732c58d9a82a</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>HTTPS</string>
          <key>ServerAddresses</key>
          <array>
            <string>2a10:50c0::bad1:ff</string>
            <string>2a10:50c0::bad2:ff</string>
            <string>94.140.14.15</string>
            <string>94.140.15.16</string>
          </array>
          <key>ServerURL</key>
          <string>https://family.adguard-dns.com/dns-query</string>
        </dict>
      </dict>
      <!-- AdGuard DNS Family Protection (DoT) -->
      <dict>
        <key>PayloadDisplayName</key>
        <string>AdGuard Family DNS over TLS</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dns.8bcd32d4-0699-4859-b5e7-aab18e8928ac</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>8bcd32d4-0699-4859-b5e7-aab18e8928ac</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>TLS</string>
          <key>ServerAddresses</key>
          <array>
            <string>2a10:50c0::bad1:ff</string>
            <string>2a10:50c0::bad2:ff</string>
            <string>94.140.14.15</string>
            <string>94.140.15.16</string>
          </array>
          <key>ServerName</key>
          <string>family.adguard-dns.com</string>
        </dict>
      </dict>
      <!-- AdGuard DNS Non-filtering (DoH) -->
      <dict>
        <key>PayloadDisplayName</key>
        <string>AdGuard Non-filtering DNS over HTTPS</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dns.a164e97e-c632-4b62-9086-65055a4d1366</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>a164e97e-c632-4b62-9086-65055a4d1366</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>HTTPS</string>
          <key>ServerAddresses</key>
          <array>
            <string>2a10:50c0::1:ff</string>
            <string>2a10:50c0::2:ff</string>
            <string>94.140.14.140</string>
            <string>94.140.14.141</string>
          </array>
          <key>ServerURL</key>
          <string>https://unfiltered.adguard-dns.com/dns-query</string>
        </dict>
      </dict>
      <!-- AdGuard DNS Non-filtering (DoT) -->
      <dict>
        <key>PayloadDisplayName</key>
        <string>AdGuard Non-filtering DNS over TLS</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dns.c604859b-b21b-4210-ac16-aa95eed509b2</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>c604859b-b21b-4210-ac16-aa95eed509b2</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>TLS</string>
          <key>ServerAddresses</key>
          <array>
            <string>2a10:50c0::1:ff</string>
            <string>2a10:50c0::2:ff</string>
            <string>94.140.14.140</string>
            <string>94.140.14.141</string>
          </array>
          <key>ServerName</key>
          <string>unfiltered.adguard-dns.com</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
